{
  "story introduction": "\\begin{wrapfigure}{r}{0.33\\textwidth}\n        \\centering\n        \\includegraphics[width=.4\\textwidth]{archie}\n        \\caption{Archie.\\\\ \\footnotesize{Photograph by Bohn.}}\n    \\end{wrapfigure}\n\n    You're relaxing at your favorite hangout when another customer catches your attention.\n    He's rather large (dare I say, \\textit{mammoth}), a bit hairy, and looking frustrated in front of his laptop.",
  "introduction image": "archie.jpg",
  "cast of characters": {
    "comment": "You can customize these names to names your students would relate to. You might as well leave 'Archie' as 'Archie' since there's nothing uniquely 'Nebraska' about him, and the Columbian Mammoth statue is named 'Archie' (and I've carefully removed Nebraska references from the photo).",
    "employer": {
      "full name": "Archie",
      "short name": "Archie",
      "introduction": "He's rather large (dare I say, \\textit{mammoth}), a bit hairy, and looking frustrated in front of his laptop."
    },
    "antagonist": {
      "full name": "H.Awk~Aye",
      "short name": "H.Awk",
      "introduction": "He introduces himself, ``Hi, I'm H.Awk~Aye.'' That's right, I'm so good at Unix that `Awk' literally is my middle name.''\nYou decide to have an irrational dislike of him."
    },
    "supporting characters": [
      {
        "full name": "Herb~Bee",
        "short name": "Herb",
        "introduction": ""
      },
      {
        "full name": "Lilith~Redd",
        "short name": "Lil",
        "introduction": ""
      }
    ]
  },
  "descriptions": {
    "teaser": "The teaser (if any) typically will be at the end of the previous week's lab",
    "introduction": "Introduce the lab in the context of the storyline",
    "progress": [
      "Short segments that advance the story",
      "from one part of the assignment to another"
    ],
    "wrapup": "Conclude the lab in the context of the storyline",
    "callback": "The callback (if any) typically will be at the start of the next week's lab",
    "xyz image": "if a string, then the name of an existing file; if a dictionary, then ['link'] the url of a known-good image, ['name'] the local name for that file, and ['search'] a search term to find a replacement if the known-good image is missing"
  },
  "PokerLab": {
    "teaser": "",
    "introduction": "``I'm Archie,'' he says, ``and I'm trying to teach myself this card game called \\textit{Poker}.\n    I found this source code that I thought I could use to understand Poker better, but the code is incomplete, and I don't entirely understand what's there.\n    Could you explain the code to me, please?''",
    "progress": null,
    "wrapup": "Archie's face lights up in a very big smile.\n    ``Thanks!''\n    After pausing in thought for a moment, he says, ``Say, I've got a new startup company that could really use your help.\n    Are you interested?\n    It'll be exciting!''",
    "callback": "\\begin{wrapfigure}{r}{0.33\\textwidth}\n        \\centering\n        \\includegraphics[width=.4\\textwidth]{some-expenses-spared}\n        \\caption{Some expenses were spared.\\\\ \\footnotesize{Original images \\textcopyright\\ Universal Studios and Amblin Entertainment, Inc. Meme creator unknown.}}\n    \\end{wrapfigure}\n\n    You've recently been hired to help get the Pleistocene Petting Zoo get started.\n    Your new employer, Archie, is surprisingly honest: he admits to you that some expenses were spared.\n    Archie cheerfully points out that any challenge is also an opportunity to succeed.\n    You suspect your job will offer plenty of ``opportunities to succeed.''",
    "callback image": {
      "link": "https://pbs.twimg.com/media/CR_8SuAUYAElSyA.png",
      "name": "some-expenses-spared.png",
      "search": "\"Spares no expense / Hires one I.T. guy\""
    }
  },
  "KeyboardLab": {
    "teaser": "",
    "introduction": "",
    "progress": [
      "You soon discover your first $\\cancelto{\\mathrm{opportunity}}{\\mathrm{challenge}}$.\nArchie purchased your workstation from an electronics recycling warehouse, and the keyboard is missing the letter \\missingKey!",
      "Archie replies to your email, assuring you that a new keyboard has been ordered.\nMeanwhile, he needs you to write some code that will",
      "Your keyboard was mistakenly delivered to the Plywood Scenery Cutting Studio instead of the Pleistocene Petting Zoo.\nWhile that gets sorted out, you ``borrow'' some tar from the La~Brea Tar Pits diorama and use the tar to re-attach your keyboard's missing keys."
    ],
    "wrapup": "Great news!\n    Archie brings you your new keyboard.\n    He also brings you a problem of his own.\n    Because you were held up with the broken keyboard, Archie decided to try some programming on his own, and his code is behaving strangely.",
    "callback": "",
    "adhesive": "tar from the diorama",
    "todo": "The end of the current wrap-up should be the teaser for LinkedListLab"
  },
  "LinkedListLab": {
    "teaser": "",
    "introduction": "Working at the Pleistocene Petting Zoo certainly is proving to be interesting.\n    You're glad that you don't have to worry about the problem of the giant sloths very slowly chasing their handlers, but now it seems that Archie has decided to try to write a program or two.\n    At a glance, his code is smellier than the wooly rhinoceros' enclosure.\n    But you take a closer look anyway to try to understand why his code acts strangely.",
    "progress": [
      "Archie shows you his first program, which he hoped would be used to greet guests, but it doesn't always work right:",
      "``Wow,'' Archie says.\n``I can't believe that I missed that.\nMaybe you can help me with some other code that I wrote for one of my other start-ups.\nHere it is.'' Archie shows you the code:",
      "``Thanks for your help,'' Archie says.\n``Maybe you can help our other developer with the project he's working on.''\nA guy walks up.\nHe's wearing a Members-Only jacket over a Hawaiian shirt and looks like he might be a comedian's nemesis in another life.\n",
      "``To protect against corporate espionage, we're writing a challenge-and-response system.\nAnybody can challenge anyone else in the Pleistocene Petting Zoo's non-public areas by providing the name of a book and a word contained within the book, and the person being challenged must respond with another word from that book, based on certain rules.\nI'm using an array-backed list to store a book's words.\nIt works fine on my desktop system, but the device from Eclectic Electronics that we're deploying it to has an interesting quirk:\nit has about a megabyte of memory, which is plenty for our needs, but it can't allocate more than 32 kilobytes of contiguous memory.\nThat's a bit of a problem for the array once the list grows large enough.''\n\nYou think about the problem for a moment, and then suggest, ``What if we replace the array-backed list with a linked list\\dots?''\n",
      "You plug in your shiny, new keyboard, tune your satellite radio to the Greatest Hits of the 1920s, and settle in to solving this interesting problem.\n"
    ],
    "wrapup": "You hear somebody enter the room.\n    ``\\textit{Frankenstein}, `boat','' is the challenge, and she answers, ``borne.''\n    Archie introduces you to the new arrival, ``Lil, this is our new developer, the one who wrote the app we just used.''\n    He turns to you: ``This is Lilith Redd from business operations.''\n    He turns back to her and continues, ``Lil, what's the good word?''\n\n    ``The word isn't good, I'm afraid.\n    I just heard back from the insurance company.''",
    "callback": ""
  },
  "IntegerLab": {
    "teaser": "",
    "introduction": "All work at the Pleistocene Petting Zoo has stopped while Archie tries to find a $\\cancelto{\\mathrm{reasonable}}{\\mathrm{gullible}}$ insurance company.\n    Rather than furloughing staff, he's asked everybody to help out with his other startup companies for a week or two.\n    He specifically asked that you help out with Eclectic Electronics.\n\n    Herb Bee, the chief engineer, explains that Eclectic Electronics is developing a patent-pending C-licon tool that will convert C code into an integrated circuit that has the same functionality as the original C code.\n    To test it out, he tasked you with writing the code to implement an Arithmetic Logic Unit (ALU).\n    Your task will be to implement integer addition, subtraction, multiplication, and division.\n    Even though high-level languages' \\textit{logical} boolean operations normally are not part of an ALU, Herb wants you to include these in the ALU to see if that can make some programs run faster.\n    Because bitwise operations and bit shift operations have been implemented, you will be able to use C's bitwise and bit shift operators, but because arithmetic operations have not yet been implemented, you cannot use C's arithmetic operators.\n    Because C library functions generally make use of arithmetic operations (which have not yet been implemented), you cannot use library functions.",
    "progress": null,
    "wrapup": "Herb smiles as he hands you the the test results from the latest integrated circuit fab batch.\n    ``C-licon successfully turned your code into an ALU.\n    Nicely done!''\n    I think maybe it's time to use C-licon to see if we can improve the Floating Point Unit (FPU) on our experimental microprocessor.",
    "callback": ""
  },
  "FloatLab": {
    "teaser": "",
    "introduction": "Herb tells you that, Eclectic Electronics tested the integrated circuit that the C-licon tool created from your ALU code, and they've concluded that C-licon is ready to use for their new experimental microprocessor.\n    He tasks you with writing C code (that will be used by the C-licon tool) to implement a Floating Point Unit (FPU).\n    Your task will be to implement floating point addition, subtraction, multiplication, and division.\n    You can use any bit operations and, thanks to the ALU you wrote, you can use any integer arithmetic operations (use the conventional + - * / operators).\n    Because the FPU has not yet been implemented, you cannot use C's floating point operations, you cannot use \\lstinline{float}s nor \\lstinline{double}s, and you cannot use library functions.",
    "progress": null,
    "wrapup": "Lil enters the room.\n    Herb challenges her: ``\\textit{Gulliver's Travels}, `endian','' and Lil answers, ``ends.''\n\n    Lil walks up to you and says, ``We have the insurance situation taken care of, and it's time to get the Zoo ready for guests.\n    We're reassembling the tech team, and there's plenty of work to do.''\n\n    You smile.\n    ``That's good news!''\n\n    Lil's face is hard to read.\n    ``Well, yes and no.\n    It's good that you'll be able to resume work on the Zoo's systems.\n    But while Archie was waiting for us to fix the insurance situation, he got bored and -- cutting a long story short -- he ended up creating some new `opportunities' that we need you `to succeed' at.''",
    "callback": ""
  },
  "AddressingLab": {
    "teaser": "",
    "introduction": "",
    "progress": null,
    "wrapup": "",
    "callback": ""
  },
  "Chapter6Lab": {
    "teaser": "",
    "introduction": "",
    "progress": null,
    "wrapup": "",
    "callback": ""
  },
  "Chapter11Lab": {
    "teaser": "",
    "introduction": "",
    "progress": null,
    "wrapup": "",
    "callback": ""
  },
  "DuplicatorLab": {
    "teaser": "",
    "introduction": "",
    "progress": null,
    "wrapup": "",
    "callback": ""
  },
  "PollingLab": {
    "teaser": "",
    "introduction.bk": "    Archie walks up to you, along with Herb Bee from Eclectic Electronics.\n    Herb is holding a tangled mess of electronics.\n    Archie explains, ``Herb here has developed a prototype of a device that he thinks will be useful for our physical security needs, as well as a few other applications around here. He calls it the \\textit{Cow Pi}.''\n\n    You look at the device in Herb's hands and see the Arduino Nano central to the circuit.\n    ``Isn't \\textit{-Pi} typically used as a suffix for circuits that use a Raspberry Pi instead of an Arduino?''\n        \n    Herb replies, ``Typically, yes, but \\textit{Cowduino} isn't very punny, is it?''\n\n    Archie chimes in, ``Maybe with the right emphasis: \\textit{Cow-DOO-ino}.''\n\n    ``That's kind of subtle, don't you think? How will people know to put the emPHAsis on that sylLAble?''\n    \n    ``I think we're getting off topic here,'' you point out.\n    ``How can I help?''\n\n    ``Oh, right,'' Herb says, ``We'd like you to kick its proverbial tires.\n    Let's start off with something simple, like a number builder tool.''",
    "introduction": "    Archie walks up to you, along with Herb Bee from Eclectic Electronics.\n    Herb is holding a tangled mess of electronics.\n    Archie explains, ``Herb here has developed a prototype of a device that he thinks will be useful for our physical security needs, as well as a few other applications around here. He calls it the \\textit{Cow Pi}.''\n\n    You look at the device in Herb's hands and see the Raspberry Pi Pico central to the circuit.\n    ``I suppose the `\\textit{-Pi}' suffix is because it uses a Raspberry Pi Pico?''\n        \n    Herb replies, ``Um, yeah, sure.\n We considered using an Arduino Nano, but \\textit{Cowduino} isn't very punny, is it?''\n\n    Archie chimes in, ``Maybe with the right emphasis: \\textit{Cow-DOO-ino}.''\n\n    ``That's kind of subtle, don't you think? How will people know to put the emPHAsis on that sylLAble?''\n    \n    ``I think we're getting off topic here,'' you point out.\n    ``How can I help?''\n\n    ``Oh, right,'' Herb says, ``We'd like you to kick its proverbial tires.\n    Let's start off with something simple, like a number builder tool.''",
    "progress": null,
    "wrapup": "Herb looks over your work.\n    ``Hmm, yes. I think this is coming along nicely.\n    Let's run a few more tests.''\n\n    Archie storms into the room.\n    ``We have \\textit{got} to do something about security!\n    How's that doodad coming along? \n    Because there's now a half-man/half-fly in the labs going on-and-on about Chaos Theory and how if we just give him a MacBook and a spaceship then he'll be able to get the Lord of Thunder to travel across the 8th Dimension.\n    Is that thing just about ready?''\n\n    Herb shakes his head, ``No, not quite yet. It should be ready in about a week.''",
    "callback": ""
  },
  "InterruptLab": {
    "teaser": "",
    "introduction": "",
    "progress": null,
    "wrapup": "",
    "callback": ""
  },
  "GroupLab": {
    "teaser": "",
    "introduction": "",
    "progress": null,
    "wrapup": "",
    "callback": ""
  },
  "MemoryLab": {
    "teaser": "",
    "introduction": "",
    "progress": null,
    "wrapup": "",
    "callback": ""
  }
}